MusaparovM/src/Documents/Заказ/Заказ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Заказ</name>
  <registerRecords>AccumulationRegister.ИсторияЗаказов</registerRecords>
  <attributes>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Клиенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Ресторан</name>
    <type>
      <types>CatalogRef.Рестораны</types>
    </type>
  </attributes>
  <attributes>
    <name>Курьер</name>
    <type>
      <types>CatalogRef.Курьеры</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаЗаказа</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусЗаказа</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Состав</name>
    <attributes>
      <name>Блюдо</name>
      <type>
        <types>CatalogRef.Блюда</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

MusaparovM/src/AccumulationRegisters/ИсторияЗаказов/ИсторияЗаказов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ИсторияЗаказов</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КоличествоБлюд</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Заказ</name>
    <type>
      <types>DocumentRef.Заказ</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Дата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Курьер</name>
    <type>
      <types>CatalogRef.Курьеры</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

MusaparovM/src/Documents/Заказ/Forms/ФормаДокумента/Module.bsl
&НаКлиенте
  Процедура СоставКоличествоПриИзменении(Элемент) Экспорт
	  Строка = Элементы.Состав.ТекущиеДанные;
	  Строка.Сумма = Строка.Количество * Строка.Цена;
	  ОбновитьОбщуюСумму();
КонецПроцедуры

&НаКлиенте
Процедура СоставЦенаПриИзменении(Элемент) Экспорт
    Строка = Элементы.Состав.ТекущиеДанные;
	Строка.Сумма = Строка.Количество * Строка.Цена;
	ОбновитьОбщуюСумму();
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьОбщуюСумму()
    ОбщаяСумма = 0;
	Для Каждого Строка Из Объект.Состав Цикл
        ОбщаяСумма = ОбщаяСумма + Строка.Сумма;
    КонецЦикла;
    Объект.СуммаЗаказа = ОбщаяСумма; // Обновление значения на форме
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ)

    // Подсчет суммы
    ОбщаяСумма = 0;
    Для Каждого Строка Из Объект.Состав Цикл
        Строка.Сумма = Строка.Количество * Строка.Цена;
        ОбщаяСумма = ОбщаяСумма + Строка.Сумма;
    КонецЦикла;
    Объект.СуммаЗаказа = ОбщаяСумма;

    // Движения по регистру ИсторияЗаказов
    НаборЗаписей = РегистрыНакопления.ИсторияЗаказов.СоздатьНаборЗаписей();
    
    Запись = НаборЗаписей.Добавить();
    Запись.Период = Объект.Дата;                // Дата заказа
    Запись.Заказ = Объект.Ссылка;               // Ссылка на документ
    Запись.Курьер = Объект.Курьер;              // Курьер
    Запись.Сумма = Объект.СуммаЗаказа;          // Подсчитанная сумма
    Запись.КоличествоБлюд = Объект.Состав.Количество();  // Кол-во строк в табл. части

    НаборЗаписей.Записать();

КонецПроцедуры
